{
    "briefDescription": "This is a brief description.",
    "description": "## Description\n\nThis is a detailed description of the project. It supports **Markdown** format. Here is a lot more text to make the description longer. This project aims to solve many problems and provide numerous features. It is designed to be user-friendly and highly efficient. The project has been tested extensively to ensure reliability and performance. We have included various examples and documentation to help you get started quickly. The project is open-source and contributions are welcome. We hope you find this project useful and look forward to your feedback.\n\n### Features\n\n- Feature 1: Detailed explanation of feature 1.\n- Feature 2: Detailed explanation of feature 2.\n- Feature 3: Detailed explanation of feature 3.\n\n### Usage\n\nTo use this project, follow these steps:\n\n1. Step 1: Detailed instructions for step 1.\n2. Step 2: Detailed instructions for step 2.\n3. Step 3: Detailed instructions for step 3.\n\n### Contributing\n\nWe welcome contributions from the community. Please read our contributing guidelines before submitting a pull request. We appreciate your help in making this project better.",
    "briefVersion": "NEW: stability and other improved features",
    "version": "<ul>\n<li>Added new \"minimal\" widget in the style of the lock screen overlay (requires Android 12 or above). This is ideal for use on devices which support lock screen widgets, instead of using the overlay. This can be configured in the same lock screen settings as the current options.</li>\n<li>Added option to disable the shadow for the overlay &amp; new widget</li>\n<li>Enabled in-app predictive back where possible</li>\n<li>Fixed an issue where the screen on recognition trigger could be invoked while the main toggle was disabled</li>\n<li>Fixed a suppressed crash when using On Demand recognition on some devices, which was causing the recognition to appear to get stuck</li>\n<li>Various bug fixes</li>\n</ul>"
}