{
    "name": "Documents UI Replacer ",
    "author": "Ph4n70m 404",
    "version": "v3",
    "updateTypeString": "module",
    "srcLink": "https://github.com/ph4n70m-404/DocumentsUI-Replacer",
    "keywords": [
        "Module"
    ],
    "images": 0,
    "README": "# DocumentsUI-Replacer\n**Stock is not fully supported because documentsui is supposed to be updated by project mainline aka google play system updates meaning it can cause weird bugs.**\n\n# Explanation & beneits\nThis is a magisk module that replaces the DocumentsUI package with the LineageOS or dotOS one. DocumentsUI is the built in file manager that depending on the rom is also the only file manager. The benefits to replacing it are:\n- Fixing any bugs on the native DocumentsUI package such as not being able to view zips\n- Making the DocumentsUI package available on the homescreen if it isn't already\n- Making the dark theme even darker with the dotOS variant\n\n# Downloading\nYou can find the latest version [here](https://github.com/ph4n70m-404/DocumentsUI-Replacer/releases/latest).  \nYou can find the changelog [here](https://github.com/ph4n70m-404/DocumentsUI-Replacer/blob/main/changelog.md).  \n\n# Installation\nDownload the zip and flash with magisk. You will be given a volume key choice, the up key being the grey dark theme(the LineageOS DocumentsUI package) and the down key being the black dark theme (the dotOS DocumentsUI package).  \nYou can use the config file (located in the release page and the temp directory in the zip) to preset the theme parameter and set it to custom to load a user picked DocumentsUI package however it must be called DocumentsUI.apk and must be in /sdcard/documentsui-replacer/custom. The config file itself must also be in the /sdcard/documentsui-replacer location.\n\n# Credits\n- [@topjohnwu](https://github.com/topjohnwu) - Magisk\n- [@Zackptg5](https://github.com/Zackptg5) - Magisk Module Template\n- [@LineageOS](https://github.com/lineageos) - The LineageOS DocumentsUI package\n- [@dotOS](https://github.com/topjohnwu) - The dotOS DocumentsUI package\n",
    "changeLog": "<p>General script cleanup<br>\nAndroid 12.1 support</p>",
    "READMEsummary": "Magisk module replaces the DocumentsUI package with the dotOS or LineageOS one.",
    "changeLogSummary": "General script cleanup Android 12.1.1 support.",
    "packageName": "documentsui_replacer"
}